In [1]:
import FinanceDataReader as fdr
fdr.__version__

'0.9.34'

In [4]:
import matplotlib.pyplot as plt
import pandas as pd

plt.rcParams["axes.grid"] = True
plt.rcParams["figure.figsize"] = (16,8)

In [5]:
url = 'http://kind.krx.co.kr/corpgeneral/corpList.do?method='\
            'download&searchType=13'
krx = pd.read_html(url, header=0)[0]
krx = krx[['종목코드', '회사명']]
krx = krx.rename(columns={'종목코드': 'code', '회사명': 'company'})
krx.code = krx.code.map('{:06d}'.format)

In [6]:
df_krx = fdr.StockListing('KRX')
tiker_list = list(df_krx.Symbol)

In [25]:
naver_index = df_krx.index[df_krx['Symbol'] == '035420'].tolist()

In [26]:
naver_index

[1334]

In [8]:
krx.code

0       000210
1       004840
2       155660
3       078930
4       294870
         ...
2531    169670
2532    318660
2533    222670
2534    331660
2535    212310
Name: code, Length: 2536, dtype: object

In [11]:
import numpy as np

In [12]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1,2,3,1,3,1,2,2,3]])

중국의 먹을 것: 짜장면, 완탕
한국의 먹을 것: 짜장면, 밥, 비빔밥 

이런 식으로 상위 개념을 하위 단계들로 내려가면서 2개 이상의 index 를 설정할 수 있다. 위의 예에서 index 는 (중국의 먹을 것, 한국의 먹을 것)이 상위 개념, 그리고 짜장면, 완탕, 밥 등이 될 수 있을 것이다.  한 가지 유의할 사항은 하위 개념은 다른 상위 범위 안에서 반복될 수 있다.  예를 들어, 짜장면은 '중국의 먹을 것'과 '한국의 먹을 것'에서 반복 되었다.

In [14]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [18]:
data.loc[['b', 'd']]

b  1   -0.148189
   3   -0.010884
d  2   -0.472657
   3    2.013252
dtype: float64

In [19]:
data.loc[:,2]

a   -1.493813
c    0.065094
d   -0.472657
dtype: float64

In [20]:
data.unstack()

          1         2         3
a -0.830828 -1.493813  1.167666
b -0.148189       NaN -0.010884
c -0.809846  0.065094       NaN
d       NaN -0.472657  2.013252

In [23]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)))

In [24]:
frame

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11